# 할당
# 가변 데이터
a = [1, 2, 3, 4]
b = a
b[0] = 100

print(a)  # [100, 2, 3, 4]
print(b)  # [100, 2, 3, 4]

# 불변 데이터
a = 20
b = a
b = 10

print(a)  # 
print(b)  # 10

# 얕은 복사
a = [1, 2, 3]
b = a[:]
c = a.copy()

b[0] = 100
c[0] = 999
print(a)  # [1, 2, 3] 
print(b)  # [100, 2, 3]
print(c)  # [999, 2, 3]

# 얕은 복사의 한계
a = [1, 2, [3, 4, 5]]
b = a[:]

b[0] = 999
b[2][1] = 100
print(a)  # [1, 2, [3, 100, 5]]
print(b)  # [999, 2, [3, 100, 5]]


# 깊은 복사
import copy

a = [1, 2, [3, 4, 5]]
b = copy.deepcopy(a)

b[2][1] = 100
print(a)  # [1, 2, [3, 4, 5]]
print(b)  # [1, 2, [3, 100, 5]]  

